benchmarks/ab_c_10_n_10000.log
ab -c 10 -n 10000  "http://127.0.0.1:8080/?long=12.234&lat=23.1131"
This is ApacheBench, Version 2.3 <$Revision: 1430300 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8080

Document Path:          /?long=12.234&lat=23.1131
Document Length:        28 bytes

Concurrency Level:      10
Time taken for tests:   12.971 seconds
Complete requests:      10000
Failed requests:        9997
   (Connect: 0, Receive: 0, Length: 9997, Exceptions: 0)
Write errors:           0
Total transferred:      1119964 bytes
HTML transferred:       399964 bytes
Requests per second:    770.94 [#/sec] (mean)
Time per request:       12.971 [ms] (mean)
Time per request:       1.297 [ms] (mean, across all concurrent requests)
Transfer rate:          84.32 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0      14
Processing:     2   13   2.9     12      58
Waiting:        0   12   2.8     11      57
Total:          4   13   2.9     12      58

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     13
  75%     13
  80%     13
  90%     14
  95%     17
  98%     21
  99%     27
 100%     58 (longest request)


 ab -c 10 -n 10000  "http://127.0.0.1:8081/?long=12.234&lat=23.1131"
This is ApacheBench, Version 2.3 <$Revision: 1430300 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        127.0.0.1
Server Port:            8081

Document Path:          /?long=12.234&lat=23.1131
Document Length:        25 bytes

Concurrency Level:      10
Time taken for tests:   4.400 seconds
Complete requests:      10000
Failed requests:        9999
   (Connect: 0, Receive: 0, Length: 9999, Exceptions: 0)
Write errors:           0
Total transferred:      1039989 bytes
HTML transferred:       359989 bytes
Requests per second:    2272.54 [#/sec] (mean)
Time per request:       4.400 [ms] (mean)
Time per request:       0.440 [ms] (mean, across all concurrent requests)
Transfer rate:          230.80 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0      12
Processing:     1    4   2.3      3      30
Waiting:        0    3   2.1      3      23
Total:          2    4   2.3      4      30

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      5
  90%      7
  95%      9
  98%     12
  99%     15
 100%     30 (longest request)